// language_ru.as
/*
    Русский перевод для Grusha CTF.
    -- -- -- -- -- -- -- -- --
    Авторы перевода:
    TerminalHash
*/
namespace ru
{
	const string

	//////////////////////////////////////////////////////////
	// Descriptions
	//////////////////////////////////////////////////////////

	// Accolades.as
	d_goldgrushatext						= "Контрибьютор Груши - за разработку мода Gruhsha CTF",
	d_bronzetokentext						= "Бронзовая монета - за поддержание игры после запуска во F2P",
	d_kiwitext								= "Контрибьютор KIW1 - за помощь в разработке мода KIW1",
	d_captaintext							= "Лучший капитан - за смелость и умение набирать хорошие команды",

	// ArcherShop.as
	d_woodenarrowdesc						= "Ставит деревянный блок на месте приземления.",
	d_stonearrowdesc						= "Ставит каменный блок на месте приземления.",
	d_mountedbowdesc						= "Стационарный арбалет для тех, кто хочет хоть немного побыть лучником.",

	// BindingsCommon.as
	d_modbindplaceholder					= "пусто",
	d_modbindnull							= "Нет клавиши",

			// Settings
	d_bmoptlag								= "Дружелюбный к лагам",
	d_bmoptvan								= "Ванильное",
	d_universalyes							= "Да",
	d_universalno							= "Нет",
	d_universalon							= "Включено",
	d_universaloff							= "Выключено",
	d_universalold							= "Старая",
	d_universalnew							= "Новая",

	// GameHelp.as
	d_header1									= "Gruhsha CTF - Русские капитаны",
	d_header2									= "Советы: Внезапная смерть",
	d_header3									= "Советы: Материалы",
	d_header4									= "Советы: Аирдроп",
	d_header5									= "Советы: Батуты",
	d_header6									= "Советы: Изменения в классах и машинах",
	d_header7									= "Советы: Новые предметы",
	d_header8									= "Советы: Настройки",

		// Main page
	d_tiptext1								= "\n\n\n\n\n\nДобро пожаловать на Gruhsha CTF!\n\nЭто соревновательная версия CTF-режима, где наведён порядок в балансе,\nдобавлены новые предметы, различные улучшения\nи исправлены самые вопиющие баги.\n\nВаша цель по-прежнему захват флага, но она ограничена\nпо времени - у вас есть 35 минут на выполнение цели, в противном случае\nвас ждёт баннер, как на картинке ниже ;)\n\nЧтобы узнать больше, почитайте данный справочник.",
		// Sudden Death
	d_tiptext2								= "За пять минут до конца матча начинается \"Внезапная смерть\".\n\nВо время неё активируются различные баффы и дебаффы, узнать которые\nвы можете, наведя на иконку черепа в левом углу экрана и почитав заметку.",
		// Materials
	d_tiptext3								= "\n\nОсновная система материалов - виртуальная командная.\nЭто значит, что вам не нужно заниматься менеджментом инвентаря\nбольшую часть вашего времени.\n\nНо со строителей по-прежнему падает реальный материал,\nего можно сконвертировать либо строителем, либо на складе.\n\nP.S. золото есть только как реальнный блоб\nи имеет высокую ценность, не теряйте его.",
		// Airdrop
	d_tiptext4								= "Каждые 6 минут в центре карты будет появляться ящик.\nВ ваших интересах забрать его как можно скорее -\nон даёт очень полезные вещи!\n\n(открыть можно только на базе)",
		// Trampolines
	d_tiptext5								= "Физика прыжков на батуте изменена - он не однократно ускоряет вас,\nа отталкивает с той скоростью и высотой, с которой вы на него попадёте.\n\nЕсли хотите пользоваться им, положите его внизу вашей базы,\nубедитесь, что вам ничего не мешает и спрыгните с крыши башни на него.",
		// Class & Vehicles
	d_tiptext6								= "\n\nВсе три класса получили различные полезные изменения:\n* Строители строят быстрее и могут кидать бомбы;\n* Лучники могут пользоваться крюком и стрелять одновременно, могут пользоваться\nбуром и кидать бомбы;\n* Рыцари получили много новых предметов в арсенал и могут пользоваться буром;\n* И многое другое.\n\nПомимо этого, добавлена пара новых машин и магазины\nдля их покупки можно свободно строить (лимит до одной штуки на команду).",
		// Items
	d_tiptext7								= "Добавлены различные новые lore-friendly предметы, которые неплохо помогут\nкак в обычном, так и скрытном (крысином) пуше.\n\nНе бойтесь пробовать что-то новое, некоторые предметы способны эффективно\nостанавливать продвижение противника ;)",
		// Settings
	d_tiptext8								= "В моде присутствует собственная система настроек.\n\nНе нравится наклон тела при движении? Не нравится поворот головы?\nХотите использовать метки, переназначить эмоции или выключить какие-то фичи?\n\nОткройте таблицу игроков (TAB по-умолчанию) и нажмите на кнопку слева от\nпанели с информацией об сервере.",

	// PickingCommands.as
	d_bindingscom							= "Открыть меню кастомных биндингов",
	d_togglechcomtext						= "Переключить смену классов в магазинах",
	d_togglechcomchat						= "Смена классов теперь ",
	d_togglechcom2							= "включена",
	d_togglechcom3							= "выключена",
	d_archerlimchat							= "Максимум лучников теперь ",
	d_archerlimtext							= "Устанавливает лимит на лучников в командах",
	d_builderlimchat						= "Максимум строителей теперь ",
	d_builderlimtext						= "Устанавливает лимит на строителей в командах",
	d_lockcomtext							= "Запрещает набирать людей в команды, запоминая состав и останавливая процесс набора игроков",
	d_lockcomchatunl						= "Команды расформированы",
	d_lockcomchatloc						= "Команды сформированы",
	d_pickcomtext							= "Берёт указанного игрока из наблюдателей в твою команду и передаёт право выбора другому Капитану",
	d_demotecomtext							= "Понизить Капитанов до обычных игроков",
	d_appointcomtext						= "Повысить двух игроков до Капитанов (они выбирают остальных игроков к себе в команду)",
	d_specallcomtext						= "Сделать всех игроков наблюдателями",
	d_preventvoicelinespamtext				= "Запретить игроку спамить войслайнами",

	// KnightShop.as
	d_stickybombdesc						= "Покрытый слизью динамит, прилипающий к поверхности. Полезен в стелс-операциях и сносе конструкций.",
	d_goldenminedesc						= "Более прочная версия мины, способна прилипать к поверхности.",
	d_slideminedesc							= "Менее прочная версия обычной мины, взводится в боевое состояние при движении.",
	d_icebombdesc							= "Снежный шар с мини-кегой внутри, способен замедлить противника на небольшое время.",
	d_fumokegdesc							= "Последнее, что вы сможете увидеть в своей жизни.",
	d_boosterdesc							= "Бутылка сжатого воздуха, толкающая предметы и игроков в противополжную от вас сторону.",

	// Satchel.as
	d_satcheldesc							= "Поджигает горючие блоки, активируется при помощи клавиши броска",

	// SoundsCommands.as
	d_togglesoundscomtext					= "Включить или выключить звук вокалайзов для себя",
	d_togglesoundschattexton				= "Надоедливые звуки войслайнов выключены, ",
	d_togglesoundschattextoff				= "Надоедливые звуки войслайнов включены, ",

	// ScoreboardCommon.as
	d_oldstatstooltip						= "Зажми клавишу \"Shift\", чтобы увидеть статистику прошлого матча",

	// ScoreboardRender.as
	d_currentversiontext					= "Текущая версия: ",
	d_helptip								= "Нажмите {KEY} чтобы включить/выключить справочное руководство.",

	// ClassSelectMenu.as
	d_totaltext								= "Всего ",

	// Quarters.as
	d_beertext								= "Кружка освежающего кваса.",
	d_mealtext								= "Нажористый и вкусный борщ.",
	d_burgertext							= "Пирожок с грушами с собой в дорогу.",
	d_peartext								= "Сочная и сладкая груша.",
	d_sleeptext								= "Прилечь поспать. Бесплатно!",

	// VehicleShop.as
	d_bomberdesc							= "Воздушное транспортное средство, может перевезти двух человек и некоторое количество груза. Можно сбрасывать предметы на клавишу Space.",

	// TimeToEnd.as
	d_thirtyminutesleft						= "Осталось 5 минут до конца раунда, поторопитесь!",
	d_suddenactive							= "РЕЖИМ ВНЕЗАПНОЙ СМЕРТИ АКТИВЕН!",
	d_kegbuff								= "* Более мощные кеги;",
	d_drillbuff1							= "* Зона дриллинга полностью выключена;",
	d_drillbuff2							= "* Рыцари и лучники получают меньше нагрева при дриллинге;",
	d_blockreqdebuff						= "* Требования блоков на миду умножаются в 1.35 раз;",
	d_respawndebuff							= "* Время респауна увеличено до 15 секунд;",
	d_shielddebuff							= "* Щиты пропускают половину урона от слешей и тычков;",
	d_swordbuff								= "* Рыцарь получает возможность раз в 30 секунд ударить огнём;",
	d_pricedebuff							= "* Пересчитываются цены на некоторые предметы.",

	//////////////////////////////////////////////////////////
	// Names
	//////////////////////////////////////////////////////////

	// ArcherShop.as
	n_woodenarrow							= "Стрела-блок (дерево)",
	n_stonearrow							= "Стрела-блок (камень)",
	n_bombarrow								= "Стрела-бомба",

	//BindingsCommon.as

		// Buttons
	n_modbindemote							= "Эмоция ",
	n_modbindsmenu							= "Метки",
	n_emotemenu								= "Эмоции",
	n_blocksmenu							= "Блоки",
	n_actionsmenu							= "Действия",
	n_archernmb								= "Магазин лучника\n (бинды)",
	n_buildernmb							= "Магазин строителя\n (бинды)",
	n_knightnmb								= "Магазин рыцаря\n (бинды)",
	n_quartersnmb							= "Магазин еды\n (бинды)",
	n_vehiclenmb							= "Магазин машин\n (бинды)",
	n_boatnmb								= "Магазин лодок\n (бинды)",
	n_settingsmenu							= "Настройки",
	n_vsettingsmenu							= "Настройки визуа-\n ла и звуков",
	n_tagwheel								= "Колесо меток",
	n_emotewheelvanilla						= "Ванильное колесо эмоций",
	n_emotewheelsecond						= "Модовое колесо эмоций",

		// Blocks
	n_stonebl								= "Каменный блок",
	n_stoneback								= "Каменная стена",
	n_stonedoor								= "Каменная дверь",
	n_woodbl								= "Деревянный блок",
	n_woodback								= "Деревянная стена",
	n_wooddoor								= "Деревянная дверь",
	n_platformt								= "Командная платформа",
	n_ladder								= "Лестница",
	n_platform								= "Платформа",
	n_shop									= "Магазин",
	n_spikes								= "Шипы",

		// Actions
	n_drillcommand							= "Достать/Убрать дрель",
	n_cancelarrowschargingcommand			= "Перестать заряжать лук",
	n_markbuildercommand					= "Отмечать позицию строителя",
	n_activateorthrowbomb					= "Активировать/бросить предмет",
	n_putitemcommand						= "Положить предмет в инвентарь",
	n_blockrotatecommand					= "Повернуть блок",
	n_showinvkey							= "Показать инвентарь блоба",

		// NoMenuBuying Binds
			// Knight Shop
	n_bombnmb								= "Бомба",
	n_waterbombnmb							= "Водная бомба",
	n_minenmb								= "Мина",
	n_kegnmb								= "Кега",
	n_drillnmb								= "Бур",
	n_satchelnmb							= "Взрывпакет",
	n_stickybombnmb							= "Липкая бомба",
	n_goldenminenmb							= "Золотая мина",
	n_icebombnmb							= "Ледяная бомба",
	n_slideminenmb							= "Слайд-мина",
	n_boosternmb							= "Бустер",
	n_fumokegnmb							= "Фумо-кега",

			// Builder Shop
	n_drillbnmb								= "Бур",
	n_spongebnmb							= "Губка",
	n_bucketwnmb							= "Ведро с водой",
	n_bouldernmb							= "Булыжник",
	n_lanternnmb							= "Фонарь",
	n_bucketnnmb							= "Ведро",
	n_trampolinenmb							= "Батут",
	n_sawnmb								= "Пила",
	n_cratewoodnmb							= "Ящик (за дерево)",
	n_cratecoinsnmb							= "Ящик (за монеты)",

			// Archer Shop
	n_arrowsnmb								= "Стрелы",
	n_waterarrowsnmb						= "Водные стрелы",
	n_firearrowsnmb							= "Огненные стрелы",
	n_bombarrowsnmb							= "Стрелы-бомбы",
	n_blockarrowsnmb						= "Стрелы-блоки (дерево)",
	n_stoneblockarrowsnmb					= "Стрелы-блоки (камень)",
	n_mountedbownmb							= "Стационарный арбалет",

			// Quarters
	n_beernmb								= "Квас",
	n_mealnmb								= "Борщ",
	n_eggnmb								= "Яйцо",
	n_burgernmb								= "Пирожок с грушей",
	n_pearnmb								= "Груша",
	n_sleepnmb								= "Спать",

			// Vehicle Shop
	n_catapultnmb							= "Катапульта",
	n_ballistanmb							= "Баллиста",
	n_bombernmb								= "Воздушный шар",
	n_outpostnmb							= "Аванпост",
	n_boltsnmb								= "Болты для баллисты",
	n_shellsnmb								= "Взрывные болты для баллисты",

			// Boat Shop
	n_dinghynmb								= "Шлюпка",
	n_longboatnmb							= "Большая лодка",
	n_warboatnmb							= "Военная лодка",

		// Settings
	n_buildmode								= "Режим строительства",
	n_blockbar								= "Показывать панель с блоками",
	n_dsewnmb								= "NoMenuBuying-фича без эмоций",
	n_shownomenubuyingpan					= "Показывать NoMenuBuying панель",
	n_nomenubuyingset						= "NoMenuBuying-фича",
	n_nomenubuyingboldarset					= "NoMenuBuying-фича (Строитель)",
	n_camerasw								= "Покачивание камеры (По-умол. 5)",
	n_bodytilt								= "Наклон тела при движении",
	n_headrotating							= "Поворот головы в сторону курсора",
	n_clusterfuck							= "Отображение частиц и кусков",
	n_clusterfuck_blood						= "Отображение крови",
	n_clusterfuck_smoke						= "Отображение дыма",
	n_drillzoneborders						= "Границы зоны дриллинга",
	n_grapplewhilecharging					= "Использовать крюк при стрельбе",
	n_annoyingnature						= "Звук от кустов и листьев",
	n_annoyingvoicelines					= "Звуки войслайнов",
	n_annoyingtags							= "Звуки меток",
	n_customdpsounds						= "Кастомные звуки смерти/боли",
	n_switchclasschanginginshop				= "Выкл. смену класса в магазинах",
	n_drillknight							= "Автоподбор дрели (Рыцарь)",
	n_drillbuilder							= "Автоподбор дрели (Строитель)",
	n_drillarcher							= "Автоподбор дрели (Лучник)",
	n_bombbuilder							= "Автоподбор бомб (Строитель)",
	n_bombarcher							= "Автоподбор бомб (Лучник)",
	n_cyclewithitem							= "Переключение с предметом в руках",
	n_visualitempick						= "Наглядное расстояние до предмета",
	n_pickupsystem							= "Система подбора предметов",
	n_classpanels							= "Показывать панели классов",
	n_airdroppanel							= "Показывать таймер аирдропа",
	n_customboomeffects						= "KIWI-like эффекты взрыва",

		// Other
	n_pressdelete							= "Выбери клавишу и нажми [DELETE] для очистки хоткея!",

	// Food.as
	n_burgerinv								= "Пирожок с грушами",

	// KnightShop.as
	n_stickybomb							= "Липкая бомба",
	n_goldenmine							= "Золотая мина",
	n_slidemine							    = "Слайд-мина",
	n_icebomb								= "Ледяная бомба",
	n_fumokegname							= "Фумо-кега",
	n_booster								= "Бустер",

	// KIWI_Playercard.as
	n_medalsn								= "Медали",
	n_partipin								= "Участие",
	n_clanbadgetext							= "Этот игрок состоит в гильдии",

	// ScoreboardCommon.as
	n_modsettingsbutton						= "Настройки",

	// ScoreboardRender.as
	n_matssection							= "Материалы",
	n_damagedealtsc							= "Урон",
	n_killsperminute						= "У/М",

	// Quarters.as
	n_beeritem								= "Квас - 1 Сердце",
	//n_beeritem								= "Пиво - 1 Сердце",
	n_mealitem								= "Борщ - Полное здоровье",
	//n_mealitem								= "Мясное блюдо - Полное здоровье",
	n_eggitem								= "Яйцо - Полное здоровье",
	n_burgeritem							= "Пирожок с грушами - Полное здоровье",
	//n_burgeritem							= "Бургер - Полное здоровье",
	n_pearitem								= "Груша - 2 Сердца",
	n_sleepaction							= "Лечь спать",

	empty 					= ""; // keep last
}
